cases/2dMaster_LFlow/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
	walls
    {
        type            wallGlobalComposition;
    }

		porewalls
    {
        type            wallGlobalComposition;
    }

	inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
	
	outlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type empty;

    }

	movingWalls_patch0
    {
        type            wallGlobalComposition;
    }
}

// ************************************************************************* //
