cases/2dMaster_LFlow/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (water air);
phase1 air;
phase2 water;


water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.48e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0707106;
/*phase1
{
    transportModel  Newtonian;
nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;
rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}

phase2
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 7.74e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 840;
}

sigma        sigma [ 1 0 -2 0 0 0 0 ]   0.01;
*/
solutionSpecies
{
    T
	{
		D1				D1 [0 2 -1 0 0 0 0] 1e-8;
		D2				D2 [0 2 -1 0 0 0 0] 1e-6;
		H				H [0 0 0 0 0 0 0] 1;
                Mw                              Mw [1 0 0 0 -1 0 0] 1;
	}
}




// ************************************************************************* //
